[
{"姓名":"邱少云","时间":"1952年","事迹":"在抗美援朝一次战斗中，人遭到打击后出动飞机侦察，并盲目发射侦察燃烧弹，一颗燃烧弹正好落在邱少云身边，飞迸的火星溅落在他的左腿上，烧着了他的棉衣、头发和皮肉。但为了不暴露潜伏部队，他严守纪律，咬紧牙关，双手深深插进泥土中，以惊人的毅力忍受着剧痛，一声不吭、一动不动，直至壮烈牺牲，年仅26岁","图片链接":"https://bkimg.cdn.bcebos.com/pic/ac4bd11373f08202cf67eaff47fbfbedaa641b7c?x-bce-process=image/watermark,image_d2F0ZXIvYmFpa2U4MA==,g_7,xp_5,yp_5"},
{"姓名":"雷锋","时间":"1961年","事迹":"五月的一天，雷锋冒雨去沈阳。他为了赶早车，早晨5点多就起来，带了几个干馒头就披上雨衣上路了。路上，雷锋看见一位妇女背着一个小孩，手还牵着一个小女孩，正艰难地向车站走去。雷锋想都没想，脱下身上的雨衣就披在大嫂身上，又抱起小女孩陪她们一起来到车站。上车后，雷锋见小女孩冷得直发抖，就把自己的贴身衬衣脱下来给她穿上。雷锋估计她们早饭没吃，就把自己带的馒头给她们吃。火车到了沈阳，天还在下雨，雷锋便把她们送到家里。那位妇女感激地说：“同志，我可怎么感谢你呀！”雷锋说 ：“不要感谢我，应该感谢党和毛主席啊！”","图片链接":"https://bkimg.cdn.bcebos.com/pic/b21bb051f8198618ddfdc53648ed2e738ad4e6ce?x-bce-process=image/watermark,image_d2F0ZXIvYmFpa2U4MA==,g_7,xp_5,yp_5"},
{"姓名":"焦裕禄","时间":"1962年","事迹":"焦裕禄来到兰考，兰考遭遇严重的灾荒，全县的粮食产量下降到历史的最低水平。在除“三害”的斗争中，为了取得经验，焦裕禄同志亲自率领干部、群众进行了小面积翻淤压沙、翻淤压碱、封闭沙丘试验。然后以点带面，全面铺开，总结出了整治三害的具体策略，探索出了大规模栽种泡桐的办法。","图片链接":"https://bkimg.cdn.bcebos.com/pic/55e736d12f2eb9387726df69d2628535e4dd6fe6?x-bce-process=image/watermark,image_d2F0ZXIvYmFpa2U3Mg==,g_7,xp_5,yp_5"},
{"姓名":"邱娥国","时间":"1979年","事迹":"33岁的邱娥国从部队转业，被分配到南昌市广外派出所担任户籍民警，1990年调往筷子巷派出所继续干户籍民警。17年里，邱娥国做孤寡老人的“孝子”，当迷路孩子的“慈父”，为群众排解了一个又一个生活难题。他说：“群众就是我的父母、亲人，他们有难处，我一个党员、人民警察不去帮，谁去帮？”年近八旬的何俊杰、黄糯女老两口的四个子女都在外地，只有春节能回家与父母团聚几天。1984年，邱娥国家搬进章江路27号，与两位老人成了邻居。十几年来，两位老人买米、买菜、倒垃圾、劈柴、搬煤球等重体力活都由邱娥国夫妇和他们的两个儿子“承包”了。","图片链接":"https://bkimg.cdn.bcebos.com/pic/91ef76c6a7efce1b7e5b5d49a551f3deb58f65c5?x-bce-process=image/watermark,image_d2F0ZXIvYmFpa2U4MA==,g_7,xp_5,yp_5"},
{"姓名":"邓小平","时间":"1984年","事迹":"邓小平在厦门考察时，明确提出和使用了“改革开放”一词。他大力支持和推动农村改革，推进以城市为中心的全面改革，指出“改革是中国第二次革命”。他关于社会主义也可以搞市场经济的论述，为中国共产党确定建立社会主义市场经济的体制的改革目标奠定了理论基础。他倡议兴办经济特区，开放14个沿海城市，开发开放上海浦东新区，推动中国全面对外开放格局的形成。他积极推进政治体制改革，强调发展社会主义民主，健全社会主义法制，在建设物质文明的同时，高度重视精神文明建设。","图片链接":"https://bkimg.cdn.bcebos.com/pic/03087bf40ad162d9ae889eab11dfa9ec8a13cd27"},
{"姓名":"孔繁森","时间":"1988年","事迹":"山东再次选派进藏干部，孔繁森第二次赴藏工作。进藏后，孔繁森担任拉萨市副市长，分管文教、卫生和民政工作。到任仅4个月，他就跑遍了全市8个县区所有的公办学校和一半以上的村办小学，为发展少数民族的教育事业奔波操劳；为结束尼木县续迈乡等3个乡群众易患大骨节病的历史，他多次爬到海拔近5000米的山顶水源处采集水样，帮群众解决饮水问题；在了解农牧区缺医少药的情况后，他每次下乡时都特地带一个医疗箱，工作之余就给农牧民群众认真地听诊、把脉、打针……","图片链接":"https://bkimg.cdn.bcebos.com/pic/7e3e6709c93d70cfa76ebc2ef8dcd100baa12b78?x-bce-process=image/resize,m_lfit,w_268,limit_1"},
{"姓名":"尕布龙","时间":"1992年","事迹":"1992年，66岁的尕布龙从省人大常委会副主任的位置上退了下来，他还想为人民多干些事情，组织上就让他担任了西宁南北山绿化专职常务副总指挥，从此他一干就是10年。10年中，尕布龙泡在南北山林区的劳动日达3520天，而且每年大年初一至初三亲自上山值班，10年来从未间断。他每天早晨7点前就背着水壶和干粮步行上山，挖坑、栽树、浇水，中午靠在树上喝口开水，在这10年中，尕布龙没拿过一分钱的报酬。近4年来，绿化办公室给他补助2800元，他用这笔钱买了树苗栽到南北两山。在尕布龙带领下，各包干厅局认真负责，完成了绿化任务。目前，南北两山4.5万亩规划造林面积中，已完成造林3.75万亩，栽植乔木554万株、灌木2452万株，平均成活率达80%以上。修建水泵站35个，安装小流量高扬程水泵52台，装机容量5181千瓦，修建大小蓄水池158座，容量9975立方米，埋设主管道55.8公里，支管道115.5公里，保证了各绿化区林木的成活率和保存率。","图片链接":"https://bkimg.cdn.bcebos.com/pic/ac4bd11373f082029dad8c544bfbfbedab641b99?x-bce-process=image/watermark,image_d2F0ZXIvYmFpa2U4MA==,g_7,xp_5,yp_5"},
{"姓名":"姜仕坤","时间":"2012年","事迹":"深入边远贫困乡村察民情、解民忧,与群众算发展增收账,为群众找发展出路,是姜仕坤多年的工作常态。由于对农村工作熟悉,姜仕坤基本成为解决群众问题的活字典,干部们遇到解决不了的事情,他耐心细致教方法,并尽量抽出时间现场办公。在他的心中,根植着深厚的农民情结。他经常对农业龙头企业和金融部门说:“要把利益让给老百姓,只有老百姓发展起来了,大家才有发展。”他有一个朴素理念:“没有贫困群众的小康,就没有晴隆县的全面小康。","图片链接":"http://www.tibet.cn/cn/Instant/municipal/201806/W020180629293328696792.jpg"}
]