[
{"name":"爱国卫生运动","time":"1952年","content":"1949年，贯彻预防为主卫生工作方针，继续开展群众性卫生运动。1952年春，美帝国主义在侵朝战争中，对朝鲜和我国发动了细菌战争。在保家卫国的浪潮中，推动了群众性卫生防疫运动的深入发展。人民群众把这项伟大的运动称之为“爱国卫生运动”。在1949-1952年，即国民经济恢复期间，为了改变旧中国不卫生状况和传染病严重流行的现实，在全国普遍开展了群众性卫生运动。在1953-1966年，即社会主义改造和建设时期，当时政务院发出继续开展爱国卫生运动的指示，要求着重抓好城市厂矿，并把突击活动与经常保洁结合起来。1955年冬，毛泽东同志起草的一个通知说：把爱国卫生运动和“除四害”讲卫生结合起来，对防治人畜疾病，保障健康起到很好的作用。1960年3月，全国人大通过的《1956-1967年全国农业发展纲要》把“除四害”讲卫生列入“纲要”的内容。党中央在1960年发出的《关于卫生工作的指示》中指出：“中央现在提醒同志们，要重视这个问题，要把过去两年放松了的爱国卫生运动重新发动起来。1966-1976年，“文化大革命”时期，许多卫生防保，包括各级爱国卫生运动委员会和其办事机构被撤并，人员有的被裁减，有的被改行；有些工作被迫处于停顿状态，致使许多城乡的卫生面貌开始恶化，疫情回升。","url":"https://bkimg.cdn.bcebos.com/pic/bd3eb13533fa828bd9219990fd1f4134970a5a46?x-bce-process=image/watermark,image_d2F0ZXIvYmFpa2U5Mg==,g_7,xp_5,yp_5"},
{"name":"医疗卫生工作的重点放到农村","time":"1956年","content":"到1965年，中共中央在批评官僚主义和过于集中的计划经济体制的同时，也批评了医疗领域存在的“老爷医院”、“城市老爷卫生部”现象，并做出“把医疗卫生工作的重点放到农村去”的决定。","url":"http://5b0988e595225.cdn.sohucs.com/images/20180702/28e30f4ddb8148c1916012e21ed636a8.jpeg"},
{"name":"赤脚医生","time":"1960年","content":"赤脚医生，是上世纪60～70年代“文化大革命”中期开始出现的名词，指没有固定编制，一般经乡村或基层政府批准和指派的有一定医疗知识和能力的医护人员，受当地乡镇卫生院直接领导和医护指导，他们的特点是：亦农亦医，农忙时务农，农闲时行医，或是白天务农，晚上送医送药的农村基层兼职医疗人员。当时来源主要有三部分：一是医学世家；二是经医护专业短期培训的学员；三是公认有一定医护能力的自学成才者。赤脚医生的出现，解决或缓解了我国广大农村地区缺医少药的问题，在广大农村地区普及爱国卫生知识、除“四害”、根除吸血虫病等方面作出了巨大贡献。","url":"http://5b0988e595225.cdn.sohucs.com/images/20190626/597cb3cd424644f1a6a10724c11957bd.jpeg"},
{"name":"计划生育","time":"1982年","content":"计划生育是中华人民共和国的一项基本国策，即按人口政策有计划的生育。1982年9月被定为基本国策，同年12月写入宪法。主要内容及目的是：提倡晚婚、晚育，少生、优生，从而有计划地控制人口。计划生育这一基本国策自制订以来，对中国的人口问题和发展问题的积极作用不可忽视，但是也带来了人口老龄化问题。到21世纪初，中国的计划生育政策又做出了一些调整。由于20世纪80年代出生的第一批独生子女已经到达适婚年龄，在许多地区，特别是经济较为发达的地区，计划生育政策有一定程度的放松。国务院印发未来15年人口规划：2030年总人口14.5亿左右","url":"https://bkimg.cdn.bcebos.com/pic/00e93901213fb80ed1a880b836d12f2eb9389460?x-bce-process=image/watermark,image_d2F0ZXIvYmFpa2UxNTA=,g_7,xp_5,yp_5"},
{"name":"新型农村合作医疗","time":"2002年","content":"2002年10月，中国明确提出各级政府要积极引导农民建立以大病统筹为主的新型农村合作医疗制度。2009年，中国作出深化医药卫生体制改革的重要战略部署，确立新农合作为农村基本医疗保障制度的地位。2015年1月29日，国家卫计委、财政部印发关于做好2015年新型农村合作医疗工作的通知提出，各级财政对新农合的人均补助标准在2014年的基础上提高60元，达到380元。2017年，各级财政对新农合的人均补助标准在2016年的基础上提高30元，达到450元，其中：中央财政对新增部分按照西部地区80%、中部地区60%的比例进行补助，对东部地区各省份分别按一定比例补助。农民个人缴费标准在2016年的基础上提高30元，原则上全国平均达到180元左右。探索建立与经济社会发展水平、各方承受能力相适应的稳定可持续筹资机制。","url":"https://bkimg.cdn.bcebos.com/pic/c8177f3e6709c93d0af40275943df8dcd1005429?x-bce-process=image/watermark,image_d2F0ZXIvYmFpa2UxMTY=,g_7,xp_5,yp_5"},
{"name":"医药卫生体制改革","time":"2009年","content":"2009—2011年重点抓好五项改革。一是加快推进基本医疗保障制度建设，二是初步建立国家基本药物制度，三是健全基层医疗卫生服务体系，四是促进基本公共卫生服务逐步均等化，五是推进公立医院改革试点。2019年6月10日，国务院办公厅印发《国务院办公厅关于印发深化医药卫生体制改革2019年重点工作任务的通知》，国新办10日就此举行政策例行吹风会。国家卫生健康委员会副主任、国务院医改领导小组秘书处副主任王贺胜表示，《重点任务》紧紧围绕解决看病难、看病贵问题，深化医疗、医保、医药联动改革，坚定不移推动医改落地见效、惠及人民群众。2020年7月，国务院办公厅印发《深化医药卫生体制改革2020年下半年重点工作任务》。","url":"https://bkimg.cdn.bcebos.com/pic/342ac65c10385343f194fcd29913b07ecb8088ed?x-bce-process=image/watermark,image_d2F0ZXIvYmFpa2U4MA==,g_7,xp_5,yp_5"}
]