var color=["#b3cde3","#ccebc5","#decbe4","#fed9a6","#8B4513","#FFE4E1","#FFA07A","#FFDAB9","#ADFF2F"];
var career=['工人',"农民","公司人员","党政人员","学生","退休","军人","其他"]
var r=[0.006,0.008,0.007,0.01,0.012,0.015,0.015,0.016,0.0165,0.017,0.0175,0.0175,0.0175,0.0175,0.019,0.018,0.019,0.019];
var data=[
{
"x": 0.05,
"y": 0.5,
"time": "1923",
"sum_num": "0.0427",
"event":"建党(1921年）之初，为强调工人阶级政党的性质，中国共产党比较注重在工人中发展党员"
},
{
"x": 0.1,
"y": 0.5,
"time": "1927",
"sum_num": "5.7956",
"event":"大革命（1924年1月至1927年7月）失败后，随着党的工作重心从城市转到农村，大批农民入党使党的阶级构成发生了变化。"

},
{
"x": 0.15000000000000002,
"y": 0.5,
"time": "1928",
"sum_num": "4.5",
"event":""
},
{
"x": 0.2,
"y": 0.5,
"time": "1930",
"sum_num": "12.23",
"event":""
},
{
"x": 0.25,
"y": 0.5,
"time": "1949",
"sum_num": "448.8",
"event":""
},
{
"x": 0.3,
"y": 0.5,
"time": "1956",
"sum_num": "898.9",
"event":""
},
{
"x": 0.35000000000000003,
"y": 0.5,
"time": "1978",
"sum_num": "2742.511",
"event":"文革时期，毛泽东在整党建党中提出“吐故纳新”、清除废料、吸收新鲜血液的思路，要求“有步骤地吸收觉悟工人入党，扩大党组织的工人成份”。"
},
{
"x": 0.4,
"y": 0.5,
"time": "2000",
"sum_num": "6451.51",
"event":"改革开放以来，党的组织的发展迎来崭新时期，但党员年龄老化、论资排辈及文化层次较低等问题也显现出来。随着邓小平加强“制度建党”与干部“四化”方针的提出和实施，经过1982-1985年党的领导班子的全面调整，约90万名老干部退到二、三线，8万多名有知识、懂业务、德才兼备的中青年干部被选拔到县以上各级干部队伍中来，“四化”建设的新局面已经打开"
},
{
"x": 0.45,
"y": 0.5,
"time": "2003",
"sum_num": "6826.2",
"event":""
},
{
"x": 0.5,
"y": 0.5,
"time": "2008",
"sum_num": "7587.6",
"event":"党的十七大（2007年10月15日）以来，随着经济社会结构的变迁，新出现的社会各阶层中的先进分子、各类“两新”组织(新经济组织、新社会组织)中的先进分子不断加入到党组织中来，使党的阶级基础和群众基础更加巩固。队伍结构更趋合理，党员的性别、民族、学历、年龄比得到优化。党的阶级性、先进性和群众性已统一起来。"
},
{
"x": 0.55,
"y": 0.5,
"time": "2012",
"sum_num": "8512.7",
"event":""
},
{
"x": 0.6000000000000001,
"y": 0.5,
"time": "2013",
"sum_num": "8668.6",
"event":""
},
{
"x": 0.6500000000000001,
"y": 0.5,
"time": "2014",
"sum_num": "8779.2",
"event":""
},
{
"x": 0.7000000000000001,
"y": 0.5,
"time": "2015",
"sum_num": "8875.8",
"event":""
},
{
"x": 0.7500000000000001,
"y": 0.5,
"time": "2016",
"sum_num": "9021.3",
"event":""
},
{
"x": 0.8,
"y": 0.5,
"time": "2017",
"sum_num": "8956.3",
"event":""
},
{
"x": 0.8500000000000001,
"y": 0.5,
"time": "2018",
"sum_num": "9056.4",
"event":""
},
{
"x": 0.9000000000000001,
"y": 0.5,
"time": "2019",
"sum_num": "9191.4",
"event":""
}
];
var dataset=[
{
"s": 1.5,
"e": 1.7,
"x": 0.05,
"y": 0.5,
"time": "1923",
"sum_num": "0.0427",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 2.3,
"e": 2.5,
"x": 0.05,
"y": 0.5,
"time": "1923",
"sum_num": "0.0427",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.7,
"e": 1.9304,
"x": 0.05,
"y": 0.5,
"time": "1923",
"sum_num": "0.0427",
"f": 1,
"text": "工人",
"per": 0.384,
"num": "0.0164"
},
{
"s": 1.9304,
"e": 2.3,
"x": 0.05,
"y": 0.5,
"time": "1923",
"sum_num": "0.0427",
"f": 1,
"text": "其他",
"per": 0.616,
"num": "0.0263"
},
{
"s": 0.5,
"e": 0.7,
"x": 0.1,
"y": 0.5,
"time": "1927",
"sum_num": "5.7956",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.3,
"e": 1.5,
"x": 0.1,
"y": 0.5,
"time": "1927",
"sum_num": "5.7956",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 0.7,
"e": 1.0048,
"x": 0.1,
"y": 0.5,
"time": "1927",
"sum_num": "5.7956",
"f": 1,
"text": "工人",
"per": 0.508,
"num": "2.944"
},
{
"s": 1.0048,
"e": 1.117,
"x": 0.1,
"y": 0.5,
"time": "1927",
"sum_num": "5.7956",
"f": 1,
"text": "农民",
"per": 0.187,
"num": "1.084"
},
{
"s": 1.117,
"e": 1.2316,
"x": 0.1,
"y": 0.5,
"time": "1927",
"sum_num": "5.7956",
"f": 1,
"text": "学生",
"per": 0.191,
"num": "1.107"
},
{
"s": 1.2316,
"e": 1.2502,
"x": 0.1,
"y": 0.5,
"time": "1927",
"sum_num": "5.7956",
"f": 1,
"text": "军人",
"per": 0.031,
"num": "0.1796"
},
{
"s": 1.2502,
"e": 1.3,
"x": 0.1,
"y": 0.5,
"time": "1927",
"sum_num": "5.7956",
"f": 1,
"text": "其他",
"per": 0.083,
"num": "0.481"
},
{
"s": 1.5,
"e": 1.7,
"x": 0.15000000000000002,
"y": 0.5,
"time": "1928",
"sum_num": "4.5",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 2.3,
"e": 2.5,
"x": 0.15000000000000002,
"y": 0.5,
"time": "1928",
"sum_num": "4.5",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.7,
"e": 1.76,
"x": 0.15000000000000002,
"y": 0.5,
"time": "1928",
"sum_num": "4.5",
"f": 1,
"text": "工人",
"per": 0.1,
"num": "0.45"
},
{
"s": 1.76,
"e": 2.216,
"x": 0.15000000000000002,
"y": 0.5,
"time": "1928",
"sum_num": "4.5",
"f": 1,
"text": "农民",
"per": 0.76,
"num": "3.42"
},
{
"s": 2.216,
"e": 2.3000000000000003,
"x": 0.15000000000000002,
"y": 0.5,
"time": "1928",
"sum_num": "4.5",
"f": 1,
"text": "其他",
"per": 0.14,
"num": "0.63"
},
{
"s": 0.5,
"e": 0.7,
"x": 0.2,
"y": 0.5,
"time": "1930",
"sum_num": "12.23",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.3,
"e": 1.5,
"x": 0.2,
"y": 0.5,
"time": "1930",
"sum_num": "12.23",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 0.7,
"e": 0.733,
"x": 0.2,
"y": 0.5,
"time": "1930",
"sum_num": "12.23",
"f": 1,
"text": "工人",
"per": 0.055,
"num": "0.673"
},
{
"s": 0.733,
"e": 1.1926,
"x": 0.2,
"y": 0.5,
"time": "1930",
"sum_num": "12.23",
"f": 1,
"text": "农民",
"per": 0.766,
"num": "9.368"
},
{
"s": 1.1926,
"e": 1.3,
"x": 0.2,
"y": 0.5,
"time": "1930",
"sum_num": "12.23",
"f": 1,
"text": "其他",
"per": 0.179,
"num": "2.189"
},
{
"s": 1.5,
"e": 1.7,
"x": 0.25,
"y": 0.5,
"time": "1949",
"sum_num": "448.8",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 2.3,
"e": 2.5,
"x": 0.25,
"y": 0.5,
"time": "1949",
"sum_num": "448.8",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.7,
"e": 1.7149999999999999,
"x": 0.25,
"y": 0.5,
"time": "1949",
"sum_num": "448.8",
"f": 1,
"text": "工人",
"per": 0.025,
"num": "11.2"
},
{
"s": 1.7149999999999999,
"e": 2.0726,
"x": 0.25,
"y": 0.5,
"time": "1949",
"sum_num": "448.8",
"f": 1,
"text": "农民",
"per": 0.596,
"num": "267.6"
},
{
"s": 2.0726,
"e": 2.2166,
"x": 0.25,
"y": 0.5,
"time": "1949",
"sum_num": "448.8",
"f": 1,
"text": "军人",
"per": 0.24,
"num": "107.6"
},
{
"s": 2.2166,
"e": 2.3000000000000003,
"x": 0.25,
"y": 0.5,
"time": "1949",
"sum_num": "448.8",
"f": 1,
"text": "其他",
"per": 0.139,
"num": "62.4"
},
{
"s": 0.5,
"e": 0.7,
"x": 0.3,
"y": 0.5,
"time": "1956",
"sum_num": "898.9",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.3,
"e": 1.5,
"x": 0.3,
"y": 0.5,
"time": "1956",
"sum_num": "898.9",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 0.7,
"e": 0.7732,
"x": 0.3,
"y": 0.5,
"time": "1956",
"sum_num": "898.9",
"f": 1,
"text": "工人",
"per": 0.122,
"num": "110"
},
{
"s": 0.7732,
"e": 1.21,
"x": 0.3,
"y": 0.5,
"time": "1956",
"sum_num": "898.9",
"f": 1,
"text": "农民",
"per": 0.728,
"num": "654.8"
},
{
"s": 1.21,
"e": 1.2993999999999999,
"x": 0.3,
"y": 0.5,
"time": "1956",
"sum_num": "898.9",
"f": 1,
"text": "军人",
"per": 0.149,
"num": "134.1"
},
{
"s": 1.5,
"e": 1.7,
"x": 0.35000000000000003,
"y": 0.5,
"time": "1978",
"sum_num": "2742.511",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 2.3,
"e": 2.5,
"x": 0.35000000000000003,
"y": 0.5,
"time": "1978",
"sum_num": "2742.511",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.7,
"e": 1.8518,
"x": 0.35000000000000003,
"y": 0.5,
"time": "1978",
"sum_num": "2742.511",
"f": 1,
"text": "工人",
"per": 0.253,
"num": "692.654"
},
{
"s": 1.8518,
"e": 2.2316,
"x": 0.35000000000000003,
"y": 0.5,
"time": "1978",
"sum_num": "2742.511",
"f": 1,
"text": "农民",
"per": 0.633,
"num": "1735.888"
},
{
"s": 2.2316,
"e": 2.2874,
"x": 0.35000000000000003,
"y": 0.5,
"time": "1978",
"sum_num": "2742.511",
"f": 1,
"text": "军人",
"per": 0.093,
"num": "254.799"
},
{
"s": 2.2874,
"e": 2.3005999999999998,
"x": 0.35000000000000003,
"y": 0.5,
"time": "1978",
"sum_num": "2742.511",
"f": 1,
"text": "其他",
"per": 0.022,
"num": "59.17"
},
{
"s": 0.5,
"e": 0.7,
"x": 0.4,
"y": 0.5,
"time": "2000",
"sum_num": "6451.51",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.3,
"e": 1.5,
"x": 0.4,
"y": 0.5,
"time": "2000",
"sum_num": "6451.51",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 0.7,
"e": 0.8979999999999999,
"x": 0.4,
"y": 0.5,
"time": "2000",
"sum_num": "6451.51",
"f": 1,
"text": "工人",
"per": 0.33,
"num": "2128.83"
},
{
"s": 0.8979999999999999,
"e": 1.0899999999999999,
"x": 0.4,
"y": 0.5,
"time": "2000",
"sum_num": "6451.51",
"f": 1,
"text": "农民",
"per": 0.32,
"num": "2064.32"
},
{
"s": 1.0899999999999999,
"e": 1.2999999999999998,
"x": 0.4,
"y": 0.5,
"time": "2000",
"sum_num": "6451.51",
"f": 1,
"text": "其他",
"per": 0.35,
"num": "2258.36"
},
{
"s": 1.5,
"e": 1.7,
"x": 0.45,
"y": 0.5,
"time": "2003",
"sum_num": "6826.2",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 2.3,
"e": 2.5,
"x": 0.45,
"y": 0.5,
"time": "2003",
"sum_num": "6826.2",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.7,
"e": 1.7696,
"x": 0.45,
"y": 0.5,
"time": "2003",
"sum_num": "6826.2",
"f": 1,
"text": "工人",
"per": 0.116,
"num": "794.2"
},
{
"s": 1.7696,
"e": 1.9646000000000001,
"x": 0.45,
"y": 0.5,
"time": "2003",
"sum_num": "6826.2",
"f": 1,
"text": "农民",
"per": 0.325,
"num": "2217"
},
{
"s": 1.9646000000000001,
"e": 2.1242,
"x": 0.45,
"y": 0.5,
"time": "2003",
"sum_num": "6826.2",
"f": 1,
"text": "其他",
"per": 0.266,
"num": "1815"
},
{
"s": 2.1242,
"e": 2.3000000000000003,
"x": 0.45,
"y": 0.5,
"time": "2003",
"sum_num": "6826.2",
"f": 1,
"text": "公司人员",
"per": 0.293,
"num": "2000"
},
{
"s": 0.5,
"e": 0.7,
"x": 0.5,
"y": 0.5,
"time": "2008",
"sum_num": "7587.6",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.3,
"e": 1.5,
"x": 0.5,
"y": 0.5,
"time": "2008",
"sum_num": "7587.6",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 0.7,
"e": 0.7582,
"x": 0.5,
"y": 0.5,
"time": "2008",
"sum_num": "7587.6",
"f": 1,
"text": "工人",
"per": 0.097,
"num": "733.6"
},
{
"s": 0.7582,
"e": 0.9448,
"x": 0.5,
"y": 0.5,
"time": "2008",
"sum_num": "7587.6",
"f": 1,
"text": "农民",
"per": 0.311,
"num": "2361.2"
},
{
"s": 0.9448,
"e": 1.0498,
"x": 0.5,
"y": 0.5,
"time": "2008",
"sum_num": "7587.6",
"f": 1,
"text": "公司人员",
"per": 0.175,
"num": "1324.1"
},
{
"s": 1.0498,
"e": 1.099,
"x": 0.5,
"y": 0.5,
"time": "2008",
"sum_num": "7587.6",
"f": 1,
"text": "党政人员",
"per": 0.082,
"num": "620.8"
},
{
"s": 1.099,
"e": 1.1152,
"x": 0.5,
"y": 0.5,
"time": "2008",
"sum_num": "7587.6",
"f": 1,
"text": "学生",
"per": 0.027,
"num": "201.4"
},
{
"s": 1.1152,
"e": 1.1878,
"x": 0.5,
"y": 0.5,
"time": "2008",
"sum_num": "7587.6",
"f": 1,
"text": "其他",
"per": 0.121,
"num": "918.3"
},
{
"s": 1.1878,
"e": 1.3006,
"x": 0.5,
"y": 0.5,
"time": "2008",
"sum_num": "7587.6",
"f": 1,
"text": "退休",
"per": 0.188,
"num": "1428.2"
},
{
"s": 1.5,
"e": 1.7,
"x": 0.55,
"y": 0.5,
"time": "2012",
"sum_num": "8512.7",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 2.3,
"e": 2.5,
"x": 0.55,
"y": 0.5,
"time": "2012",
"sum_num": "8512.7",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.7,
"e": 1.751,
"x": 0.55,
"y": 0.5,
"time": "2012",
"sum_num": "8512.7",
"f": 1,
"text": "工人",
"per": 0.085,
"num": "725.0"
},
{
"s": 1.751,
"e": 1.9298,
"x": 0.55,
"y": 0.5,
"time": "2012",
"sum_num": "8512.7",
"f": 1,
"text": "农民",
"per": 0.298,
"num": "2534.8"
},
{
"s": 1.9298,
"e": 2.1224,
"x": 0.55,
"y": 0.5,
"time": "2012",
"sum_num": "8512.7",
"f": 1,
"text": "公司人员",
"per": 0.321,
"num": "2735.3"
},
{
"s": 2.1224,
"e": 2.1727999999999996,
"x": 0.55,
"y": 0.5,
"time": "2012",
"sum_num": "8512.7",
"f": 1,
"text": "党政人员",
"per": 0.084,
"num": "715.7"
},
{
"s": 2.1727999999999996,
"e": 2.1931999999999996,
"x": 0.55,
"y": 0.5,
"time": "2012",
"sum_num": "8512.7",
"f": 1,
"text": "学生",
"per": 0.034,
"num": "290.5"
},
{
"s": 2.1931999999999996,
"e": 2.2405999999999997,
"x": 0.55,
"y": 0.5,
"time": "2012",
"sum_num": "8512.7",
"f": 1,
"text": "其他",
"per": 0.079,
"num": "673.3"
},
{
"s": 2.2405999999999997,
"e": 2.3503999999999996,
"x": 0.55,
"y": 0.5,
"time": "2012",
"sum_num": "8512.7",
"f": 1,
"text": "退休",
"per": 0.183,
"num": "1553.8"
},
{
"s": 0.5,
"e": 0.7,
"x": 0.6000000000000001,
"y": 0.5,
"time": "2013",
"sum_num": "8668.6",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.3,
"e": 1.5,
"x": 0.6000000000000001,
"y": 0.5,
"time": "2013",
"sum_num": "8668.6",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 0.7,
"e": 0.751,
"x": 0.6000000000000001,
"y": 0.5,
"time": "2013",
"sum_num": "8668.6",
"f": 1,
"text": "工人",
"per": 0.085,
"num": "734.3"
},
{
"s": 0.751,
"e": 0.9292,
"x": 0.6000000000000001,
"y": 0.5,
"time": "2013",
"sum_num": "8668.6",
"f": 1,
"text": "农民",
"per": 0.297,
"num": "2570.3"
},
{
"s": 0.9292,
"e": 1.0744,
"x": 0.6000000000000001,
"y": 0.5,
"time": "2013",
"sum_num": "8668.6",
"f": 1,
"text": "公司人员",
"per": 0.242,
"num": "2096.8"
},
{
"s": 1.0744,
"e": 1.1248,
"x": 0.6000000000000001,
"y": 0.5,
"time": "2013",
"sum_num": "8668.6",
"f": 1,
"text": "党政人员",
"per": 0.084,
"num": "730.3"
},
{
"s": 1.1248,
"e": 1.1428,
"x": 0.6000000000000001,
"y": 0.5,
"time": "2013",
"sum_num": "8668.6",
"f": 1,
"text": "学生",
"per": 0.03,
"num": "260.4"
},
{
"s": 1.1428,
"e": 1.1902,
"x": 0.6000000000000001,
"y": 0.5,
"time": "2013",
"sum_num": "8668.6",
"f": 1,
"text": "其他",
"per": 0.079,
"num": "687.4"
},
{
"s": 1.1902,
"e": 1.2999999999999998,
"x": 0.6000000000000001,
"y": 0.5,
"time": "2013",
"sum_num": "8668.6",
"f": 1,
"text": "退休",
"per": 0.183,
"num": "1589.1"
},
{
"s": 1.5,
"e": 1.7,
"x": 0.6500000000000001,
"y": 0.5,
"time": "2014",
"sum_num": "8779.2",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 2.3,
"e": 2.5,
"x": 0.6500000000000001,
"y": 0.5,
"time": "2014",
"sum_num": "8779.2",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.7,
"e": 1.7504,
"x": 0.6500000000000001,
"y": 0.5,
"time": "2014",
"sum_num": "8779.2",
"f": 1,
"text": "工人",
"per": 0.084,
"num": "734.2"
},
{
"s": 1.7504,
"e": 1.9274,
"x": 0.6500000000000001,
"y": 0.5,
"time": "2014",
"sum_num": "8779.2",
"f": 1,
"text": "农民",
"per": 0.295,
"num": "2593.7"
},
{
"s": 1.9274,
"e": 2.0744,
"x": 0.6500000000000001,
"y": 0.5,
"time": "2014",
"sum_num": "8779.2",
"f": 1,
"text": "公司人员",
"per": 0.245,
"num": "2154.8"
},
{
"s": 2.0744,
"e": 2.1247999999999996,
"x": 0.6500000000000001,
"y": 0.5,
"time": "2014",
"sum_num": "8779.2",
"f": 1,
"text": "党政人员",
"per": 0.084,
"num": "739.7"
},
{
"s": 2.1247999999999996,
"e": 2.1403999999999996,
"x": 0.6500000000000001,
"y": 0.5,
"time": "2014",
"sum_num": "8779.2",
"f": 1,
"text": "学生",
"per": 0.026,
"num": "224.7"
},
{
"s": 2.1403999999999996,
"e": 2.1889999999999996,
"x": 0.6500000000000001,
"y": 0.5,
"time": "2014",
"sum_num": "8779.2",
"f": 1,
"text": "其他",
"per": 0.081,
"num": "710.5"
},
{
"s": 2.1889999999999996,
"e": 2.3,
"x": 0.6500000000000001,
"y": 0.5,
"time": "2014",
"sum_num": "8779.2",
"f": 1,
"text": "退休",
"per": 0.185,
"num": "1621.6"
},
{
"s": 0.5,
"e": 0.7,
"x": 0.7000000000000001,
"y": 0.5,
"time": "2015",
"sum_num": "8875.8",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.3,
"e": 1.5,
"x": 0.7000000000000001,
"y": 0.5,
"time": "2015",
"sum_num": "8875.8",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 0.7,
"e": 0.7492,
"x": 0.7000000000000001,
"y": 0.5,
"time": "2015",
"sum_num": "8875.8",
"f": 1,
"text": "工人",
"per": 0.082,
"num": "724.4"
},
{
"s": 0.7492,
"e": 0.9249999999999999,
"x": 0.7000000000000001,
"y": 0.5,
"time": "2015",
"sum_num": "8875.8",
"f": 1,
"text": "农民",
"per": 0.293,
"num": "2602.5"
},
{
"s": 0.9249999999999999,
"e": 1.0744,
"x": 0.7000000000000001,
"y": 0.5,
"time": "2015",
"sum_num": "8875.8",
"f": 1,
"text": "公司人员",
"per": 0.249,
"num": "2205.9"
},
{
"s": 1.0744,
"e": 1.1248,
"x": 0.7000000000000001,
"y": 0.5,
"time": "2015",
"sum_num": "8875.8",
"f": 1,
"text": "党政人员",
"per": 0.084,
"num": "748.5"
},
{
"s": 1.1248,
"e": 1.1386,
"x": 0.7000000000000001,
"y": 0.5,
"time": "2015",
"sum_num": "8875.8",
"f": 1,
"text": "学生",
"per": 0.023,
"num": "203.4"
},
{
"s": 1.1386,
"e": 1.1884000000000001,
"x": 0.7000000000000001,
"y": 0.5,
"time": "2015",
"sum_num": "8875.8",
"f": 1,
"text": "其他",
"per": 0.083,
"num": "733.0"
},
{
"s": 1.1884000000000001,
"e": 1.3006000000000002,
"x": 0.7000000000000001,
"y": 0.5,
"time": "2015",
"sum_num": "8875.8",
"f": 1,
"text": "退休",
"per": 0.187,
"num": "1658.1"
},
{
"s": 1.5,
"e": 1.7,
"x": 0.7500000000000001,
"y": 0.5,
"time": "2016",
"sum_num": "9021.3",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 2.3,
"e": 2.5,
"x": 0.7500000000000001,
"y": 0.5,
"time": "2016",
"sum_num": "9021.3",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.7,
"e": 1.7473999999999998,
"x": 0.7500000000000001,
"y": 0.5,
"time": "2016",
"sum_num": "9021.3",
"f": 1,
"text": "工人",
"per": 0.079,
"num": "709.2"
},
{
"s": 1.7473999999999998,
"e": 1.9202,
"x": 0.7500000000000001,
"y": 0.5,
"time": "2016",
"sum_num": "9021.3",
"f": 1,
"text": "农民",
"per": 0.288,
"num": "2596.0"
},
{
"s": 1.9202,
"e": 2.0749999999999997,
"x": 0.7500000000000001,
"y": 0.5,
"time": "2016",
"sum_num": "9021.3",
"f": 1,
"text": "公司人员",
"per": 0.258,
"num": "2331.7"
},
{
"s": 2.0749999999999997,
"e": 2.1254,
"x": 0.7500000000000001,
"y": 0.5,
"time": "2016",
"sum_num": "9021.3",
"f": 1,
"text": "党政人员",
"per": 0.084,
"num": "756.2"
},
{
"s": 2.1254,
"e": 2.138,
"x": 0.7500000000000001,
"y": 0.5,
"time": "2016",
"sum_num": "9021.3",
"f": 1,
"text": "学生",
"per": 0.021,
"num": "187.0"
},
{
"s": 2.138,
"e": 2.1877999999999997,
"x": 0.7500000000000001,
"y": 0.5,
"time": "2016",
"sum_num": "9021.3",
"f": 1,
"text": "其他",
"per": 0.083,
"num": "748.5"
},
{
"s": 2.1877999999999997,
"e": 2.3005999999999998,
"x": 0.7500000000000001,
"y": 0.5,
"time": "2016",
"sum_num": "9021.3",
"f": 1,
"text": "退休",
"per": 0.188,
"num": "1692.7"
},
{
"s": 0.5,
"e": 0.7,
"x": 0.8,
"y": 0.5,
"time": "2017",
"sum_num": "8956.3",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.3,
"e": 1.5,
"x": 0.8,
"y": 0.5,
"time": "2017",
"sum_num": "8956.3",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 0.7,
"e": 0.7444,
"x": 0.8,
"y": 0.5,
"time": "2017",
"sum_num": "8956.3",
"f": 1,
"text": "工人",
"per": 0.074,
"num": "664.8"
},
{
"s": 0.7444,
"e": 0.9154,
"x": 0.8,
"y": 0.5,
"time": "2017",
"sum_num": "8956.3",
"f": 1,
"text": "农民",
"per": 0.285,
"num": "2549.9"
},
{
"s": 0.9154,
"e": 1.0695999999999999,
"x": 0.8,
"y": 0.5,
"time": "2017",
"sum_num": "8956.3",
"f": 1,
"text": "公司人员",
"per": 0.257,
"num": "2304.2"
},
{
"s": 1.0695999999999999,
"e": 1.1199999999999999,
"x": 0.8,
"y": 0.5,
"time": "2017",
"sum_num": "8956.3",
"f": 1,
"text": "党政人员",
"per": 0.084,
"num": "754.2"
},
{
"s": 1.1199999999999999,
"e": 1.132,
"x": 0.8,
"y": 0.5,
"time": "2017",
"sum_num": "8956.3",
"f": 1,
"text": "学生",
"per": 0.02,
"num": "178.8"
},
{
"s": 1.132,
"e": 1.1824,
"x": 0.8,
"y": 0.5,
"time": "2017",
"sum_num": "8956.3",
"f": 1,
"text": "其他",
"per": 0.084,
"num": "750.4"
},
{
"s": 1.1824,
"e": 1.2999999999999998,
"x": 0.8,
"y": 0.5,
"time": "2017",
"sum_num": "8956.3",
"f": 1,
"text": "退休",
"per": 0.196,
"num": "1754.0"
},
{
"s": 1.5,
"e": 1.7,
"x": 0.8500000000000001,
"y": 0.5,
"time": "2018",
"sum_num": "9056.4",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 2.3,
"e": 2.5,
"x": 0.8500000000000001,
"y": 0.5,
"time": "2018",
"sum_num": "9056.4",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.7,
"e": 1.7431999999999999,
"x": 0.8500000000000001,
"y": 0.5,
"time": "2018",
"sum_num": "9056.4",
"f": 1,
"text": "工人",
"per": 0.072,
"num": "651.4"
},
{
"s": 1.7431999999999999,
"e": 1.9118,
"x": 0.8500000000000001,
"y": 0.5,
"time": "2018",
"sum_num": "9056.4",
"f": 1,
"text": "农民",
"per": 0.281,
"num": "2544.3"
},
{
"s": 1.9118,
"e": 2.0696,
"x": 0.8500000000000001,
"y": 0.5,
"time": "2018",
"sum_num": "9056.4",
"f": 1,
"text": "公司人员",
"per": 0.263,
"num": "2380.7"
},
{
"s": 2.0696,
"e": 2.12,
"x": 0.8500000000000001,
"y": 0.5,
"time": "2018",
"sum_num": "9056.4",
"f": 1,
"text": "党政人员",
"per": 0.084,
"num": "756.4"
},
{
"s": 2.12,
"e": 2.132,
"x": 0.8500000000000001,
"y": 0.5,
"time": "2018",
"sum_num": "9056.4",
"f": 1,
"text": "学生",
"per": 0.02,
"num": "180.5"
},
{
"s": 2.132,
"e": 2.1806,
"x": 0.8500000000000001,
"y": 0.5,
"time": "2018",
"sum_num": "9056.4",
"f": 1,
"text": "其他",
"per": 0.081,
"num": "731.4"
},
{
"s": 2.1806,
"e": 2.3006,
"x": 0.8500000000000001,
"y": 0.5,
"time": "2018",
"sum_num": "9056.4",
"f": 1,
"text": "退休",
"per": 0.2,
"num": "1814.8"
},
{
"s": 0.5,
"e": 0.7,
"x": 0.9000000000000001,
"y": 0.5,
"time": "2019",
"sum_num": "9191.4",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 1.3,
"e": 1.5,
"x": 0.9000000000000001,
"y": 0.5,
"time": "2019",
"sum_num": "9191.4",
"f": 0,
"text": "",
"per": "",
"num": ""
},
{
"s": 0.7,
"e": 0.742,
"x": 0.9000000000000001,
"y": 0.5,
"time": "2019",
"sum_num": "9191.4",
"f": 1,
"text": "工人",
"per": 0.07,
"num": "644.5"
},
{
"s": 0.742,
"e": 0.9088,
"x": 0.9000000000000001,
"y": 0.5,
"time": "2019",
"sum_num": "9191.4",
"f": 1,
"text": "农民",
"per": 0.278,
"num": "2556.1"
},
{
"s": 0.9088,
"e": 1.069,
"x": 0.9000000000000001,
"y": 0.5,
"time": "2019",
"sum_num": "9191.4",
"f": 1,
"text": "公司人员",
"per": 0.267,
"num": "2450.7"
},
{
"s": 1.069,
"e": 1.1194,
"x": 0.9000000000000001,
"y": 0.5,
"time": "2019",
"sum_num": "9191.4",
"f": 1,
"text": "党政人员",
"per": 0.084,
"num": "767.8"
},
{
"s": 1.1194,
"e": 1.132,
"x": 0.9000000000000001,
"y": 0.5,
"time": "2019",
"sum_num": "9191.4",
"f": 1,
"text": "学生",
"per": 0.021,
"num": "196.0"
},
{
"s": 1.132,
"e": 1.1782,
"x": 0.9000000000000001,
"y": 0.5,
"time": "2019",
"sum_num": "9191.4",
"f": 1,
"text": "其他",
"per": 0.077,
"num": "710.4"
},
{
"s": 1.1782,
"e": 1.2999999999999998,
"x": 0.9000000000000001,
"y": 0.5,
"time": "2019",
"sum_num": "9191.4",
"f": 1,
"text": "退休",
"per": 0.203,
"num": "1866.1"
}
];


var margin = {
        top: 10,
        right: 10,
        bottom: 10,
        left: 10
    },
    width = 1300 - margin.left - margin.right,
    height = 580 - margin.top - margin.bottom;
    
    var radius=width*0.018;
    var inner=width*0.003;
    var outner=width*0.011;   //确定圆形和弧之间的位置关系

var svg2 = d3.select("#party").append("svg")
    .attr("id","svg2")
    .attr("width", width + margin.left + margin.right)
    .attr("height", height + margin.top + margin.bottom)
    // .append("g")
    .attr("transform",
        "translate(" + margin.left + "," + margin.top + ")");



//圆弧
var path_arc = svg2.append("g").selectAll(".Path_arc")
    .data(dataset)
    .enter()
    .append("path")
    .attr("class", "path_arc")
    .attr("id", function(d, i) {
        return "path_arc" + i;
    })
    .attr("d",d3.arc()     
            .innerRadius(function(d){
                return radius+inner;
            })
            .outerRadius(function (d) {
                return radius+outner+width*0.03*d.per;
            })
            .startAngle(function (d) {
                return Math.PI * d.s;
            })
            .endAngle(function (d) {
                return Math.PI * d.e;
            })
            .padAngle(0.01)
            .padRadius(function(d){
                return radius+inner;
            })
        ) 
    .attr("transform", function(d) {
        return "translate(" + width * d.x + "," + height * d.y + ")";
    })
    .attr("id",function(d,i){
        return "Arc"+d.text;
    })
    .attr("stroke", "#FFEBCD")
    .attr("stroke-width", "0.1px")
    .attr("fill", function(d,i) {
        if(d.text=="工人")
            return color[0];
        else if(d.text=="农民")
            return color[1];
        else if(d.text=="公司人员")
            return color[2];
        else if(d.text=="党政人员")
            return color[3];
        else if(d.text=="学生")
            return color[4];
        else if(d.text=="退休")
            return color[5];
        else if(d.text=="军人")
            return color[6];
        else if(d.text=="其他")
            return color[7];
        else
            return "#FFEBCD";
    })
    .on("mouseover", function(d) {
        var a = d3.select(this).attr("id");
        if(a.substring(3)!=""){
            tooltip.html(a.substring(3)+":"+d.num)
            //设置tooltip的位置(left,top 相对于页面的距离) 
                .style("left",(d3.event.pageX)+"px")
                .style("top",(d3.event.pageY+20)+"px")
                .style("opacity",1.0);
        }
        if(a=="Arc工人")
            $("#Arc工人").css("stroke",color[0]).css("stroke-width", "10px");
        else if(a=="Arc农民")
            $("#Arc农民").css("stroke",color[1]).css("stroke-width", "10px");
        else if(a=="Arc公司人员")
            $("#Arc公司人员").css("stroke",color[2]).css("stroke-width", "10px");
        else if(a=="Arc党政人员")
            $("#Arc党政人员").css("stroke",color[3]).css("stroke-width", "10px");
        else if(a=="Arc学生")
            $("#Arc学生").css("stroke",color[4]).css("stroke-width", "10px");
        else if(a=="Arc退休")
            $("#Arc退休").css("stroke",color[5]).css("stroke-width", "10px");
        else if(a=="Arc军人")
            $("#Arc军人").css("stroke",color[6]).css("stroke-width", "10px");
        else if(a=="Arc其他")
            $("#Arc其他").css("stroke",color[7]).css("stroke-width", "10px");
        
    })
    .on("mouseout", function(d) {
        tooltip.style("opacity",0.0);
        var a = d3.select(this).attr("id");
        if(a=="Arc工人"){
            $("#Arc工人").css("stroke-width", "0.1px");
        }
        else if(a=="Arc农民")
            $("#Arc农民").css("stroke-width", "0.1px");
        else if(a=="Arc公司人员")
            $("#Arc公司人员").css("stroke-width", "0.1px");
        else if(a=="Arc党政人员")
            $("#Arc党政人员").css("stroke-width", "0.1px");
        else if(a=="Arc学生")
            $("#Arc学生").css("stroke-width", "0.1px");
        else if(a=="Arc退休")
            $("#Arc退休").css("stroke-width", "0.1px");
        else if(a=="Arc军人")
            $("#Arc军人").css("stroke-width", "0.1px");
        else if(a=="Arc其他")
            $("#Arc其他").css("stroke-width", "0.1px");
    })

        
svg2.append("text")
    .attr("x",width/2.5)
    .attr("y",height/4)
    .text("1923年——2019年党员结构图");

//圆圈提示框
var tooltip = d3.select("body").append("div")
                .attr("class","tooltip") //用于css设置类样式
                .attr("opacity",0.0);		
//画圆
var path_circle=svg2.append("g").selectAll(".Circle")
    .data(data)
    .enter()
    .append("circle")
    .attr("id",function(d,i){
        return "circle"+i;
    })
    .attr("r",function(d,i){
        return width*r[i];
    })
    .attr("cx",function(d,i){
        return width * d.x;
    })
    .attr("cy",function(d,i){
        return height * d.y;
    })
    .attr("fill","#FFEBCD")
    .on("mouseover",function(d)
    {	
        //设置tooltip文字
        tooltip.html("党员人数: "+d.sum_num+"万人"+"<br/>"+d.event)
        //设置tooltip的位置(left,top 相对于页面的距离) 
                .style("left",(d3.event.pageX)+"px")
                .style("top",(d3.event.pageY+20)+"px")
                .style("opacity",1.0);
    })
    .on("mouseout",function(d)
    {
        tooltip.style("opacity",0.0);
    });

svg2.append("g").selectAll(".text")
    .data(data)
    .enter()
    .append("text")
    .attr('transform', function(d,i){
        return 'translate(' + width * d.x+ ',' + height * d.y+ ')'
    })
    .attr("font-size","10px")
    .attr("fill","black")
    .attr("text-anchor","middle")
    .attr("x",function(d){
        d3.select(this).append('tspan')
                    .attr('x',0)
                    .attr('y',0)
                    .text(function() {
                        return d.time;
                    });

        // d3.select(this).append('tspan')
        //         .attr('x', 0)
        //         .attr('y', height * 0.02)
        //         .text(function() {
        //             return d.sum_num
        //         });
    });
                       

//画图标
        var margin = {'left': 8, 'right': 10, 'top': 25, 'bottom': 10}

        var recthei = 15, rectwid = 40, rectpad = 20;

        var  rect= svg2.append('g')
            .attr('transform', 'translate(' + width/3.5+ ',' + height/1.5 + ')')

        rect.selectAll('.rect')
        .data(career)
        .enter()
        .append('rect')
        .attr('x', function (d, i) {
            return margin.left + i * (rectwid + rectpad)
        })
        .attr('y', margin.top)
        .attr('width', rectwid)
        .attr('height', recthei)
        .attr('fill', function (d, i) {
            return color[i];
        })

        svg2.append('g').selectAll(".text")
        .data(career)
        .enter()
        .append("text")
        .attr('transform', 'translate(' + width/3.5+ ',' + height/1.5 + ')')
        .attr('x', function (d, i) {
            if(d.length==2)
                return margin.left + i * (rectwid + rectpad)+7 ;
            else{
                return margin.left + i * (rectwid + rectpad)-5 ;
            }
        })
        .attr('y', margin.top + recthei + 13)
        .text(function (d) {
            return d;
        })
        .attr('fill', 'black')
        .attr('font-size',13)